### Тема "Вычисления с помощью Numpy"

#### Задание 1

In [1]:
import numpy as np

In [2]:
a=np.array([[1, 6],
           [2, 8],
           [3, 11],
           [3, 10],
           [1, 7]])

In [3]:
a[1,1]

8

In [4]:
mean_a = a.mean(axis = 0)
mean_a

array([2. , 8.4])

#### Задание 2

In [5]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

#### Задание 3

In [9]:
a_centered_sp = a_centered[0:5,0] @ a_centered[0:5,1]
a_centered_sp

8.0

In [10]:
a_centered_sp = a_centered_sp / 4
a_centered_sp

2.0

#### Задание 4

In [13]:
cov = np.cov(a.transpose())[0, 1]
cov

2.0

### Тема "Работа с данными в Pandas"

#### Задание 1

In [2]:
import pandas as pd

In [13]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Тургенев','Чехов','Островский']}, 
                       columns=['author_id', 'author_name'])
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [14]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 
                                   'Гроза', 'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]}, 
                    columns=['author_id', 'book_title', 'price'])
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Задание 2

In [18]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3

In [24]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

#### Задание 4

In [25]:
price_min = authors_price.groupby('author_name').agg({'price':'min'})
price_min = price_min.reset_index()
price_min = price_min.rename(columns={'price':'min_price'})
price_min

  author_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [26]:
price_max = authors_price.groupby('author_name').agg({'price':'max'})
price_max = price_max.reset_index()
price_max = price_max.rename(columns={'price':'max_price'})
price_max

  author_name  max_price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [27]:
price_mean = authors_price.groupby('author_name').agg({'price':'mean'})
price_mean = price_mean.reset_index()
price_mean = price_mean.rename(columns={'price':'mean_price'})
price_mean

  author_name  mean_price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000

In [31]:
authors_stat = pd.merge(price_min, price_max, on = 'author_name', how = 'outer')
authors_stat = pd.merge(authors_stat, price_mean, on = 'author_name', how = 'outer')
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

#### Задание 5

In [33]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [37]:
?pd.pivot_table

In [39]:
import numpy as np

In [41]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], 
                           columns=['cover'], aggfunc=np.sum)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      NaN
Тургенев      650.0    450.0
Чехов           NaN    950.0

In [42]:
book_info.fillna(0, inplace = True)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [43]:
book_info.to_pickle('book_info.pkl')

In [45]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0